ARM-software/AVH-TFLmicrospeech/Platform_IMXRT1050-EVKB/RTE/Board_Support/MIMXRT1052DVL6B/pin_mux.h
/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
/* Routed pin properties */
#define BOARD_INITCSI_CSI_HSYNC_PERIPHERAL                                   CSI   /*!< Peripheral name */
#define BOARD_INITCSI_CSI_HSYNC_SIGNAL                                 csi_hsync   /*!< Signal name */

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4] */
/* Routed pin properties */
#define BOARD_INITCSI_CSI_I2C_SCL_PERIPHERAL                              LPI2C1   /*!< Peripheral name */
#define BOARD_INITCSI_CSI_I2C_SCL_SIGNAL                                     SCL   /*!< Signal name */

/* GPIO_AD_B1_01 (coord K11), I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6] */
/* Routed pin properties */
#define BOARD_INITCSI_CSI_I2C_SDA_PERIPHERAL                              LPI2C1   /*!< Peripheral name */
#define BOARD_INITCSI_CSI_I2C_SDA_SIGNAL                                     SDA   /*!< Signal name */

/* GPIO_AD_B0_04 (coord F11), CSI_PWDN/J35[17]/BOOT_MODE[0] */
/* Routed pin properties */
#define BOARD_INITCSI_CSI_PWDN_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITCSI_CSI_PWDN_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITCSI_CSI_PWDN_CHANNEL                                        4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITCSI_CSI_PWDN_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITCSI_CSI_PWDN_GPIO_PIN                                       4U   /*!< GPIO pin number */
#define BOARD_INITCSI_CSI_PWDN_GPIO_PIN_MASK                          (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITCSI_CSI_PWDN_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITCSI_CSI_PWDN_PIN                                            4U   /*!< PORT pin number */
#define BOARD_INITCSI_CSI_PWDN_PIN_MASK                               (1U << 4U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCSI(void);

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D0_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D0_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D0_CHANNEL                                        0U   /*!< Signal channel */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D1_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D1_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D1_CHANNEL                                        1U   /*!< Signal channel */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D2_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D2_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D2_CHANNEL                                        2U   /*!< Signal channel */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_CLK_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_CLK_SIGNAL                                 lcdif_clk   /*!< Signal name */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D3_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D3_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D3_CHANNEL                                        3U   /*!< Signal channel */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D4_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D4_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D4_CHANNEL                                        4U   /*!< Signal channel */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D5_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D5_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D5_CHANNEL                                        5U   /*!< Signal channel */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D6_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D6_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D6_CHANNEL                                        6U   /*!< Signal channel */

/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D7_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D7_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D7_CHANNEL                                        7U   /*!< Signal channel */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D8_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D8_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D8_CHANNEL                                        8U   /*!< Signal channel */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D9_PERIPHERAL                                  LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D9_SIGNAL                                 lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D9_CHANNEL                                        9U   /*!< Signal channel */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D10_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D10_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D10_CHANNEL                                      10U   /*!< Signal channel */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D11_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D11_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D11_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_INITLCD_LCDIF_D12_PERIPHERAL                                 LCDIF   /*!< Peripheral name */
#define BOARD_INITLCD_LCDIF_D12_SIGNAL                                lcdif_data   /*!< Signal name */
#define BOARD_INITLCD_LCDIF_D12_CHANNEL                                      12U   /*!< Signal channel */

